ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/DMASS0_RINGACC_0_RINGACC_CFG.xml
<module name="DMASS0_RINGACC_0_RINGACC_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="RINGACC_CFG_BA_LO" acronym="RINGACC_CFG_BA_LO" offset="0x40" width="32" description="The Tx Ring Base Address Lo Register contains the 32 LSBs of the base address for the ring which is used to hand off pending work for the channel from the Host. The base address must be aligned to the element size of the ring, or to double the element size of the ring if the qmode is CREDENTIALS or QM modes. A write to this register will reset the associated ring to clear the occupancies and reset the pointers.">
		<bitfield id="ADDR_LO" width="32" begin="31" end="0" resetval="0x0" description="Tx Ring base address (LSBs)" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="RINGACC_CFG_BA_HI" acronym="RINGACC_CFG_BA_HI" offset="0x44" width="32" description="The Tx Ring Base Address Hi Register contains the 16 MSBs of the base address for the ring which is used to hand off pending work for the channel from the Host. The base address must be aligned to the element size of the ring, or to double the element size of the ring if the qmode is CREDENTIALS or QM modes. A write to this register will reset the associated ring to clear the occupancies and reset the pointers.">
		<bitfield id="ADDR_HI" width="16" begin="15" end="0" resetval="0x0" description="Tx Ring base address (MSBs)" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="RINGACC_CFG_SIZE" acronym="RINGACC_CFG_SIZE" offset="0x48" width="32" description="The Tx Ring Size Register contains the element size and element counts for the ring which is used to hand off pending work for the channel from the Host. A write to this register will reset the associated ring to clear the occupancies and reset the pointers.">
		<bitfield id="QMODE" width="2" begin="31" end="30" resetval="0x0" description="Defines the mode for this ring or queue." range="31 - 30" rwaccess="R/W"/> 
		<bitfield id="ELSIZE" width="3" begin="26" end="24" resetval="0x0" description="Ring element size. This field is encoded as follows: 0 = 4 bytes 1 = 8 bytes 2 = 16 bytes 3 = 32 bytes 4 = 64 bytes 5 = 128 bytes 6 = 256 bytes 7 = RESERVED" range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="SIZE" width="20" begin="19" end="0" resetval="0x0" description="Tx Ring element count. This field configures the size of the ring in elements. For rings in CREDENTIALS or QM modes the size must be an even number." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="RINGACC_CFG_EVT" acronym="RINGACC_CFG_EVT" offset="0x4C" width="32" description="The Ring Event Register is an Output Event Steering 'OES' register that specifies the event number used to denote the occurrence of an up event [empty to not-empty] or a down event [non-empty to empty] for this ring.">
		<bitfield id="EVT" width="16" begin="15" end="0" resetval="0x65535" description="Defines the event for this ring or queue." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="RINGACC_CFG_ORDERID" acronym="RINGACC_CFG_ORDERID" offset="0x50" width="32" description="The Ring OrderID Register contains the bus orderid value for the ring memory access.">
		<bitfield id="REPLACE" width="1" begin="4" end="4" resetval="0x0" description="Indicates to replace the bus orderid value for this ring or queue with the orderid MMR field. This allows control over the orderid value when it must be restricted due to the topology for QoS reasons. 0 = bypass and use the orderid from the source transaction for the destination transaction. 1 = use the orderid MMR field value for the destination transaction." range="4" rwaccess="R/W"/> 
		<bitfield id="ORDERID" width="4" begin="3" end="0" resetval="0x0" description="Defines the bus orderid value for this ring or queue." range="3 - 0" rwaccess="R/W"/>
	</register>
</module>